betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_spi.h
} DDL_I2S_InitTypeDef;

/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup I2S_DDL_Exported_Constants I2S Exported Constants
  * @{
  */

/** @defgroup I2S_DDL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with DDL_I2S_ReadReg function
  * @{
  */
#define DDL_I2S_SR_RXNE                     DDL_SPI_STS_RXBNEFLG           /*!< Rx buffer not empty flag         */
#define DDL_I2S_SR_TXE                      DDL_SPI_STS_TXBEFLG            /*!< Tx buffer empty flag             */
#define DDL_I2S_SR_BSY                      DDL_SPI_STS_BSYFLG             /*!< Busy flag                        */
#define DDL_I2S_SR_UDR                      SPI_STS_UDRFLG                 /*!< Underrun flag                    */
#define DDL_I2S_SR_OVR                      DDL_SPI_STS_OVRFLG             /*!< Overrun flag                     */
#define DDL_I2S_SR_FRE                      DDL_SPI_STS_FFERR              /*!< TI mode frame format error flag  */
/**
  * @}
  */

/** @defgroup SPI_DDL_EC_IT IT Defines
  * @brief    IT defines which can be used with DDL_SPI_ReadReg and  DDL_SPI_WriteReg functions
  * @{
  */
#define DDL_I2S_CTRL2_RXNEIE                DDL_SPI_CTRL2_RXBNEIEN         /*!< Rx buffer not empty interrupt enable */
#define DDL_I2S_CTRL2_TXEIE                 DDL_SPI_CTRL2_TXBEIEN          /*!< Tx buffer empty interrupt enable     */
#define DDL_I2S_CTRL2_ERRIE                 DDL_SPI_CTRL2_ERRIEN           /*!< Error interrupt enable               */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_DATA_FORMAT Data format
  * @{
  */
#define DDL_I2S_DATAFORMAT_16B              0x00000000U                                  /*!< Data length 16 bits, Channel length 16bit */
#define DDL_I2S_DATAFORMAT_16B_EXTENDED     (SPI_I2SCFG_CHLEN)                           /*!< Data length 16 bits, Channel length 32bit */
#define DDL_I2S_DATAFORMAT_24B              (SPI_I2SCFG_CHLEN | SPI_I2SCFG_DATALEN_0)    /*!< Data length 24 bits, Channel length 32bit */
#define DDL_I2S_DATAFORMAT_32B              (SPI_I2SCFG_CHLEN | SPI_I2SCFG_DATALEN_1)    /*!< Data length 16 bits, Channel length 32bit */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_POLARITY Clock Polarity
  * @{
  */
#define DDL_I2S_POLARITY_LOW                0x00000000U             /*!< Clock steady state is low level  */
#define DDL_I2S_POLARITY_HIGH               (SPI_I2SCFG_CPOL)       /*!< Clock steady state is high level */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_STANDARD I2s Standard
  * @{
  */
#define DDL_I2S_STANDARD_PHILIPS            0x00000000U                                                         /*!< I2S standard philips                      */
#define DDL_I2S_STANDARD_MSB                (SPI_I2SCFG_I2SSSEL_0)                                              /*!< MSB justified standard (left justified)   */
#define DDL_I2S_STANDARD_LSB                (SPI_I2SCFG_I2SSSEL_1)                                              /*!< LSB justified standard (right justified)  */
#define DDL_I2S_STANDARD_PCM_SHORT          (SPI_I2SCFG_I2SSSEL_0 | SPI_I2SCFG_I2SSSEL_1)                       /*!< PCM standard, short frame synchronization */
#define DDL_I2S_STANDARD_PCM_LONG           (SPI_I2SCFG_I2SSSEL_0 | SPI_I2SCFG_I2SSSEL_1 | SPI_I2SCFG_PFSSEL) /*!< PCM standard, long frame synchronization  */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_MODE Operation Mode
  * @{
  */
#define DDL_I2S_MODE_SLAVE_TX               0x00000000U                                   /*!< Slave Tx configuration  */
#define DDL_I2S_MODE_SLAVE_RX               (SPI_I2SCFG_I2SMOD_0)                        /*!< Slave Rx configuration  */
#define DDL_I2S_MODE_MASTER_TX              (SPI_I2SCFG_I2SMOD_1)                        /*!< Master Tx configuration */
#define DDL_I2S_MODE_MASTER_RX              (SPI_I2SCFG_I2SMOD_0 | SPI_I2SCFG_I2SMOD_1) /*!< Master Rx configuration */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_PRESCALER_FACTOR Prescaler Factor
  * @{
  */
#define DDL_I2S_PRESCALER_PARITY_EVEN       0x00000000U               /*!< Odd factor: Real divider value is =  I2SDIV * 2    */
#define DDL_I2S_PRESCALER_PARITY_ODD        (SPI_I2SPSC_ODDPS >> 8U)     /*!< Odd factor: Real divider value is = (I2SDIV * 2)+1 */
/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)

/** @defgroup I2S_DDL_EC_MCLK_OUTPUT MCLK Output
  * @{
  */
#define DDL_I2S_MCLK_OUTPUT_DISABLE         0x00000000U               /*!< Master clock output is disabled */
#define DDL_I2S_MCLK_OUTPUT_ENABLE          (SPI_I2SPSC_MCOEN)         /*!< Master clock output is enabled  */
/**
  * @}
  */

/** @defgroup I2S_DDL_EC_AUDIO_FREQ Audio Frequency
  * @{
  */

#define DDL_I2S_AUDIOFREQ_192K              192000U       /*!< Audio Frequency configuration 192000 Hz       */
#define DDL_I2S_AUDIOFREQ_96K               96000U        /*!< Audio Frequency configuration  96000 Hz       */
#define DDL_I2S_AUDIOFREQ_48K               48000U        /*!< Audio Frequency configuration  48000 Hz       */
#define DDL_I2S_AUDIOFREQ_44K               44100U        /*!< Audio Frequency configuration  44100 Hz       */
#define DDL_I2S_AUDIOFREQ_32K               32000U        /*!< Audio Frequency configuration  32000 Hz       */
#define DDL_I2S_AUDIOFREQ_22K               22050U        /*!< Audio Frequency configuration  22050 Hz       */
#define DDL_I2S_AUDIOFREQ_16K               16000U        /*!< Audio Frequency configuration  16000 Hz       */
#define DDL_I2S_AUDIOFREQ_11K               11025U        /*!< Audio Frequency configuration  11025 Hz       */
#define DDL_I2S_AUDIOFREQ_8K                8000U         /*!< Audio Frequency configuration   8000 Hz       */
#define DDL_I2S_AUDIOFREQ_DEFAULT           2U            /*!< Audio Freq not specified. Register I2SDIV = 2 */
/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup I2S_DDL_Exported_Macros I2S Exported Macros
  * @{
  */

/** @defgroup I2S_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in I2S register
  * @param  __INSTANCE__ I2S Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_I2S_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in I2S register
  * @param  __INSTANCE__ I2S Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_I2S_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/

