betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_spi.h
/** @defgroup I2S_DDL_Exported_Functions I2S Exported Functions
  * @{
  */

/** @defgroup I2S_DDL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Select I2S mode and Enable I2S peripheral
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_Enable(SPI_TypeDef *SPIx)
{
  SET_BIT(SPIx->I2SCFG, SPI_I2SCFG_MODESEL | SPI_I2SCFG_I2SEN);
}

/**
  * @brief  Disable I2S peripheral
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_Disable(SPI_TypeDef *SPIx)
{
  CLEAR_BIT(SPIx->I2SCFG, SPI_I2SCFG_MODESEL | SPI_I2SCFG_I2SEN);
}

/**
  * @brief  Check if I2S peripheral is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabled(SPI_TypeDef *SPIx)
{
  return ((READ_BIT(SPIx->I2SCFG, SPI_I2SCFG_I2SEN) == (SPI_I2SCFG_I2SEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set I2S data frame length
  * @param  SPIx SPI Instance
  * @param  DataFormat This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_DATAFORMAT_16B
  *         @arg @ref DDL_I2S_DATAFORMAT_16B_EXTENDED
  *         @arg @ref DDL_I2S_DATAFORMAT_24B
  *         @arg @ref DDL_I2S_DATAFORMAT_32B
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetDataFormat(SPI_TypeDef *SPIx, uint32_t DataFormat)
{
  MODIFY_REG(SPIx->I2SCFG, SPI_I2SCFG_DATALEN | SPI_I2SCFG_CHLEN, DataFormat);
}

/**
  * @brief  Get I2S data frame length
  * @param  SPIx SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_I2S_DATAFORMAT_16B
  *         @arg @ref DDL_I2S_DATAFORMAT_16B_EXTENDED
  *         @arg @ref DDL_I2S_DATAFORMAT_24B
  *         @arg @ref DDL_I2S_DATAFORMAT_32B
  */
__STATIC_INLINE uint32_t DDL_I2S_GetDataFormat(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SCFG, SPI_I2SCFG_DATALEN | SPI_I2SCFG_CHLEN));
}

/**
  * @brief  Set I2S clock polarity
  * @param  SPIx SPI Instance
  * @param  ClockPolarity This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_POLARITY_LOW
  *         @arg @ref DDL_I2S_POLARITY_HIGH
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetClockPolarity(SPI_TypeDef *SPIx, uint32_t ClockPolarity)
{
  SET_BIT(SPIx->I2SCFG, ClockPolarity);
}

/**
  * @brief  Get I2S clock polarity
  * @param  SPIx SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_I2S_POLARITY_LOW
  *         @arg @ref DDL_I2S_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t DDL_I2S_GetClockPolarity(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SCFG, SPI_I2SCFG_CPOL));
}

/**
  * @brief  Set I2S standard protocol
  * @param  SPIx SPI Instance
  * @param  Standard This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_STANDARD_PHILIPS
  *         @arg @ref DDL_I2S_STANDARD_MSB
  *         @arg @ref DDL_I2S_STANDARD_LSB
  *         @arg @ref DDL_I2S_STANDARD_PCM_SHORT
  *         @arg @ref DDL_I2S_STANDARD_PCM_LONG
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetStandard(SPI_TypeDef *SPIx, uint32_t Standard)
{
  MODIFY_REG(SPIx->I2SCFG, SPI_I2SCFG_I2SSSEL | SPI_I2SCFG_PFSSEL, Standard);
}

/**
  * @brief  Get I2S standard protocol
  * @param  SPIx SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_I2S_STANDARD_PHILIPS
  *         @arg @ref DDL_I2S_STANDARD_MSB
  *         @arg @ref DDL_I2S_STANDARD_LSB
  *         @arg @ref DDL_I2S_STANDARD_PCM_SHORT
  *         @arg @ref DDL_I2S_STANDARD_PCM_LONG
  */
__STATIC_INLINE uint32_t DDL_I2S_GetStandard(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SCFG, SPI_I2SCFG_I2SSSEL | SPI_I2SCFG_PFSSEL));
}

/**
  * @brief  Set I2S transfer mode
  * @param  SPIx SPI Instance
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_MODE_SLAVE_TX
  *         @arg @ref DDL_I2S_MODE_SLAVE_RX
  *         @arg @ref DDL_I2S_MODE_MASTER_TX
  *         @arg @ref DDL_I2S_MODE_MASTER_RX
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetTransferMode(SPI_TypeDef *SPIx, uint32_t Mode)
{
  MODIFY_REG(SPIx->I2SCFG, SPI_I2SCFG_I2SMOD, Mode);
}

/**
  * @brief  Get I2S transfer mode
  * @param  SPIx SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_I2S_MODE_SLAVE_TX
  *         @arg @ref DDL_I2S_MODE_SLAVE_RX
  *         @arg @ref DDL_I2S_MODE_MASTER_TX
  *         @arg @ref DDL_I2S_MODE_MASTER_RX
  */
__STATIC_INLINE uint32_t DDL_I2S_GetTransferMode(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SCFG, SPI_I2SCFG_I2SMOD));
}

/**
  * @brief  Set I2S linear prescaler
  * @param  SPIx SPI Instance
  * @param  PrescalerLinear Value between Min_Data=0x02 and Max_Data=0xFF
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetPrescalerLinear(SPI_TypeDef *SPIx, uint8_t PrescalerLinear)
{
  MODIFY_REG(SPIx->I2SPSC, SPI_I2SPSC_I2SPSC, PrescalerLinear);
}

/**
  * @brief  Get I2S linear prescaler
  * @param  SPIx SPI Instance
  * @retval PrescalerLinear Value between Min_Data=0x02 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t DDL_I2S_GetPrescalerLinear(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SPSC, SPI_I2SPSC_I2SPSC));
}

/**
  * @brief  Set I2S parity prescaler
  * @param  SPIx SPI Instance
  * @param  PrescalerParity This parameter can be one of the following values:
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_ODD
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_SetPrescalerParity(SPI_TypeDef *SPIx, uint32_t PrescalerParity)
{
  MODIFY_REG(SPIx->I2SPSC, SPI_I2SPSC_ODDPS, PrescalerParity << 8U);
}

/**
  * @brief  Get I2S parity prescaler
  * @param  SPIx SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref DDL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE uint32_t DDL_I2S_GetPrescalerParity(SPI_TypeDef *SPIx)
{
  return (uint32_t)(READ_BIT(SPIx->I2SPSC, SPI_I2SPSC_ODDPS) >> 8U);
}

/**
  * @brief  Enable the master clock output (Pin MCK)
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableMasterClock(SPI_TypeDef *SPIx)
{
  SET_BIT(SPIx->I2SPSC, SPI_I2SPSC_MCOEN);
}

/**
  * @brief  Disable the master clock output (Pin MCK)
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableMasterClock(SPI_TypeDef *SPIx)
{
  CLEAR_BIT(SPIx->I2SPSC, SPI_I2SPSC_MCOEN);
}

/**
  * @brief  Check if the master clock output (Pin MCK) is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledMasterClock(SPI_TypeDef *SPIx)
{
  return ((READ_BIT(SPIx->I2SPSC, SPI_I2SPSC_MCOEN) == (SPI_I2SPSC_MCOEN)) ? 1UL : 0UL);
}

/**
  * @}
  */

