betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_spi.h
/** @defgroup I2S_DDL_EF_FLAG FLAG Management
  * @{
  */

/**
  * @brief  Check if Rx buffer is not empty
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_RXNE(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsActiveFlag_RXNE(SPIx);
}

/**
  * @brief  Check if Tx buffer is empty
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_TXE(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsActiveFlag_TXE(SPIx);
}

/**
  * @brief  Get busy flag
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_BSY(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsActiveFlag_BSY(SPIx);
}

/**
  * @brief  Get overrun error flag
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_OVR(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsActiveFlag_OVR(SPIx);
}

/**
  * @brief  Get underrun error flag
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_UDR(SPI_TypeDef *SPIx)
{
  return ((READ_BIT(SPIx->STS, SPI_STS_UDRFLG) == (SPI_STS_UDRFLG)) ? 1UL : 0UL);
}

#if defined(SPI_STS_FFERR)
/**
  * @brief  Get frame format error flag
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_FRE(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsActiveFlag_FRE(SPIx);
}
#endif /* SPI_STS_FFERR */

/**
  * @brief  Get channel side flag.
  * @note   0: Channel Left has to be transmitted or has been received\n
  *         1: Channel Right has to be transmitted or has been received\n
  *         It has no significance in PCM mode.
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsActiveFlag_CHSIDE(SPI_TypeDef *SPIx)
{
  return ((READ_BIT(SPIx->STS, SPI_STS_SCHDIR) == (SPI_STS_SCHDIR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear overrun error flag
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_ClearFlag_OVR(SPI_TypeDef *SPIx)
{
  DDL_SPI_ClearFlag_OVR(SPIx);
}

/**
  * @brief  Clear underrun error flag
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_ClearFlag_UDR(SPI_TypeDef *SPIx)
{
  __IO uint32_t tmpreg;
  tmpreg = SPIx->STS;
  (void)tmpreg;
}

#if defined(SPI_STS_FFERR)
/**
  * @brief  Clear frame format error flag
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_ClearFlag_FRE(SPI_TypeDef *SPIx)
{
  DDL_SPI_ClearFlag_FRE(SPIx);
}
#endif /* SPI_STS_FFERR */

/**
  * @}
  */

/** @defgroup I2S_DDL_EF_IT Interrupt Management
  * @{
  */

/**
  * @brief  Enable error IT
  * @note   This bit controls the generation of an interrupt when an error condition occurs (OVR, UDR and FRE in I2S mode).
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableIT_ERR(SPI_TypeDef *SPIx)
{
  DDL_SPI_EnableIT_ERR(SPIx);
}

/**
  * @brief  Enable Rx buffer not empty IT
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableIT_RXNE(SPI_TypeDef *SPIx)
{
  DDL_SPI_EnableIT_RXNE(SPIx);
}

/**
  * @brief  Enable Tx buffer empty IT
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableIT_TXE(SPI_TypeDef *SPIx)
{
  DDL_SPI_EnableIT_TXE(SPIx);
}

/**
  * @brief  Disable error IT
  * @note   This bit controls the generation of an interrupt when an error condition occurs (OVR, UDR and FRE in I2S mode).
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableIT_ERR(SPI_TypeDef *SPIx)
{
  DDL_SPI_DisableIT_ERR(SPIx);
}

/**
  * @brief  Disable Rx buffer not empty IT
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableIT_RXNE(SPI_TypeDef *SPIx)
{
  DDL_SPI_DisableIT_RXNE(SPIx);
}

/**
  * @brief  Disable Tx buffer empty IT
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableIT_TXE(SPI_TypeDef *SPIx)
{
  DDL_SPI_DisableIT_TXE(SPIx);
}

/**
  * @brief  Check if ERR IT is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledIT_ERR(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsEnabledIT_ERR(SPIx);
}

/**
  * @brief  Check if RXNE IT is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledIT_RXNE(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsEnabledIT_RXNE(SPIx);
}

/**
  * @brief  Check if TXE IT is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledIT_TXE(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsEnabledIT_TXE(SPIx);
}

/**
  * @}
  */

/** @defgroup I2S_DDL_EF_DMA DMA Management
  * @{
  */

/**
  * @brief  Enable DMA Rx
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableDMAReq_RX(SPI_TypeDef *SPIx)
{
  DDL_SPI_EnableDMAReq_RX(SPIx);
}

/**
  * @brief  Disable DMA Rx
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableDMAReq_RX(SPI_TypeDef *SPIx)
{
  DDL_SPI_DisableDMAReq_RX(SPIx);
}

/**
  * @brief  Check if DMA Rx is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledDMAReq_RX(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsEnabledDMAReq_RX(SPIx);
}

/**
  * @brief  Enable DMA Tx
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_EnableDMAReq_TX(SPI_TypeDef *SPIx)
{
  DDL_SPI_EnableDMAReq_TX(SPIx);
}

/**
  * @brief  Disable DMA Tx
  * @param  SPIx SPI Instance
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_DisableDMAReq_TX(SPI_TypeDef *SPIx)
{
  DDL_SPI_DisableDMAReq_TX(SPIx);
}

/**
  * @brief  Check if DMA Tx is enabled
  * @param  SPIx SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_I2S_IsEnabledDMAReq_TX(SPI_TypeDef *SPIx)
{
  return DDL_SPI_IsEnabledDMAReq_TX(SPIx);
}

/**
  * @}
  */

/** @defgroup I2S_DDL_EF_DATA DATA Management
  * @{
  */

/**
  * @brief  Read 16-Bits in data register
  * @param  SPIx SPI Instance
  * @retval RxData Value between Min_Data=0x0000 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint16_t DDL_I2S_ReceiveData16(SPI_TypeDef *SPIx)
{
  return DDL_SPI_ReceiveData16(SPIx);
}

/**
  * @brief  Write 16-Bits in data register
  * @param  SPIx SPI Instance
  * @param  TxData Value between Min_Data=0x0000 and Max_Data=0xFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_I2S_TransmitData16(SPI_TypeDef *SPIx, uint16_t TxData)
{
  DDL_SPI_TransmitData16(SPIx, TxData);
}

/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup I2S_DDL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus DDL_I2S_DeInit(SPI_TypeDef *SPIx);
ErrorStatus DDL_I2S_Init(SPI_TypeDef *SPIx, DDL_I2S_InitTypeDef *I2S_InitStruct);
void        DDL_I2S_StructInit(DDL_I2S_InitTypeDef *I2S_InitStruct);
void        DDL_I2S_ConfigPrescaler(SPI_TypeDef *SPIx, uint32_t PrescalerLinear, uint32_t PrescalerParity);
#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
ErrorStatus DDL_I2S_InitFullDuplex(SPI_TypeDef *I2Sxext, DDL_I2S_InitTypeDef *I2S_InitStruct);
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* APM32F402xx || APM32F403xx || APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

#endif /* defined (SPI1) || defined (SPI2) || defined (SPI3) || defined (SPI4) || defined (SPI5) || defined(SPI6) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_SPI_H */

